# -*- coding: utf-8 -*-

GAMES_DATA = {
    "آيات": [
        {"q": "أكمل الآية: 'إِنَّا أَعْطَيْنَاكَ....'", "a": "الْكَوْثَرَ"},
        {"q": "أكمل الآية: 'اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ....'", "a": "الْقَيُّومُ"}
    ],
    "امثال": [
        {"q": "أكمل المثل البدوي: 'الرجال مخابر ما هي....'", "a": "مناظر"}
    ],
    "اليمن": [
        {"q": "ما هي اكبر محافظة يمنيه؟", "a": "حضرموت"}
    ],
    "كيمياء": [{"q": "ما هو الرمز الكيميائي للماء؟", "a": "H2O"}],
    "احياء": [{"q": "ما هي وحدة البناء في جسم الكائن الحي؟", "a": "الخلية"}],
    "فيزياء": [{"q": "ما هي وحدة قياس القوة؟", "a": "نيوتن"}],
    "رياضيات": [{"q": "كم ناتج ضرب 7 في 8؟", "a": "56"}],
    "انقليزي": [{"q": "ما معنى كلمة 'Book'؟", "a": "كتاب"}],
    "عربي": [{"q": "ما هو إعراب الفاعل دائماً؟", "a": "مرفوع"}],
    "جغرافيا": [{"q": "ما هي عاصمة السعودية؟", "a": "الرياض"}],
    "تاريخ": [{"q": "في أي عام بدأت الحرب العالمية الأولى؟", "a": "1914"}],
    "تفكيك": [{"q": "فكك كلمة 'بدوية'", "a": "ب د و ي ة"}],
    "ترتيب": [{"q": "رتب الحروف التالية: 'م ح د'", "a": "حمد"}],
    "دول": [{"q": "🏳️ دولة عاصمتها القاهرة فما هي؟", "a": "مصر"}]
}
